Tekla.Structures.Drawing.DatabaseObject
The DatabaseObject class is a base class for all drawing objects.

Tekla.Structures.Drawing.DatabaseObject.QueryReturnValue
Status information about the latest database operation (select, insert, modify, delete).

Tekla.Structures.Drawing.DatabaseObject.DrawingIdentifier
Database identifier. All drawings have an unique identifier.

Tekla.Structures.Drawing.DatabaseObject.Identifier
Database identifier. All drawing objects have an unique identifier.

Tekla.Structures.Drawing.DatabaseObject.ViewIdentifier
Database identifier. All views have an unique identifier inside the drawing.

Tekla.Structures.Drawing.DatabaseObject.Insert
Inserts the object instance into the database. The inserted instance must be of a real type.
Returns: True on success.

Tekla.Structures.Drawing.DatabaseObject.Select
Selects the object instance from the database.
Returns: True on success.

Tekla.Structures.Drawing.DatabaseObject.Modify
Modifies the instance in the database.
Returns: True on success.

Tekla.Structures.Drawing.DatabaseObject.Delete
Deletes the instance from the database.
Returns: True on success.

Tekla.Structures.Drawing.DatabaseObject.IsSameDatabaseObject(Tekla.Structures.Drawing.DatabaseObject)
Returns true if the current object and the given object are referencing the same database object.
Object: The other object to be used.
Returns: True if the objects are referencing the same database object.

Tekla.Structures.Drawing.DatabaseObject.GetMaxPropertyValueStringLength
Gets max property value string length.

Tekla.Structures.Drawing.DatabaseObject.QueryUserPropertyGet(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.Drawing.DatabaseObject.QueryUserPropertySet(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.Drawing.DatabaseObject.UserPropertySet(System.String,Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)
Sets a user property (UDA) to the drawing.
Name: The property's name.
Property: The property.
Returns: True on success.

Tekla.Structures.Drawing.DatabaseObject.UserPropertyGet(System.String,Tekla.Structures.DrawingInternal.QueryTypeEnum,Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)
Gets a user property (UDA) from the drawing.
Name: The property's name.
queryType: The query type.
Property: The property.
Returns: True on success.

Tekla.Structures.Drawing.DatabaseObject.SetUserProperty(System.String,System.String)
Sets a string property for the drawing object. The object has to be in a drawing before
the method can be used.
Name: The name of the property to be set.
Value: The new value for the property.
Returns: True if the property was set successfully.
Throws System.ArgumentException: Throws an exception if property name or value have larger than supported length.

Tekla.Structures.Drawing.DatabaseObject.SetUserProperty(System.String,System.Int32)
Sets an integer property for the drawing object. The object has to be in a drawing before
the method can be used.
Name: The name of the property to be set.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Drawing.DatabaseObject.SetUserProperty(System.String,System.Double)
Sets a double property for the drawing object. The object has to be in a drawing before
the method can be used.
Name: The name of the property to be set.
Value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Drawing.DatabaseObject.GetUserProperty(System.String,System.String@)
Gets a string property from the drawing object. The object has to be in a drawing before
the method can be used.
Name: The name of the property to be gotten.
Value: The value of the property.
Returns: True if the property was gotten successfully.

Tekla.Structures.Drawing.DatabaseObject.GetUserProperty(System.String,System.Int32@)
Gets an integer property from the drawing object. The object has to be in a drawing before
the method can be used.
Name: The name of the property to be gotten.
Value: The value of the property.
Returns: True if the property was gotten successfully.

Tekla.Structures.Drawing.DatabaseObject.GetUserProperty(System.String,System.Double@)
Gets a double property from the drawing object. The object has to be in a drawing before
the method can be used.
Name: The name of the property to be gotten.
Value: The value of the property.
Returns: True if the property was gotten successfully.

Tekla.Structures.Drawing.DatabaseObject.GetStringUserProperties(System.Collections.Generic.List{System.String},System.Collections.Generic.Dictionary{System.String,System.String}@)
Retrieves all string user properties for the object with the given list of names.
names: List of names to get the values for.
values: Dictionary of name/value pairs that contain the values of the found user properties with the given names.
Returns: True if the request succeeded (the returned values can still be empty if no such UserProperties were found).

Tekla.Structures.Drawing.DatabaseObject.GetDoubleUserProperties(System.Collections.Generic.List{System.String},System.Collections.Generic.Dictionary{System.String,System.Double}@)
Retrieves all double user properties for the object with the given list of names.
names: List of names to get the values for.
values: Dictionary of name/value pairs that contain the values of the found user properties with the given names.
Returns: True if the request succeeded (the returned values can still be empty if no such UserProperties were found).

Tekla.Structures.Drawing.DatabaseObject.GetIntegerUserProperties(System.Collections.Generic.List{System.String},System.Collections.Generic.Dictionary{System.String,System.Int32}@)
Retrieves all integer user properties for the object with the given list of names.
names: List of names to get the values for.
values: Dictionary of name/value pairs that contain the values of the found user properties with the given names.
Returns: True if the request succeeded (the returned values can still be empty if no such UserProperties were found).

Tekla.Structures.Drawing.DatabaseObject.GetStringUserProperties(System.Collections.Generic.Dictionary{System.String,System.String}@)
Retrieves all string user properties for the object with the given list of names.
values: Dictionary of name/value pairs that contain the values of the found user properties with the given names.
Returns: True if the request succeeded (the returned values can still be empty if no UserProperties were found).

Tekla.Structures.Drawing.DatabaseObject.GetDoubleUserProperties(System.Collections.Generic.Dictionary{System.String,System.Double}@)
Retrieves all double user properties for the object with the given list of names.
values: Dictionary of name/value pairs that contain the values of the found user properties with the given names.
Returns: True if the request succeeded (the returned values can still be empty if no UserProperties were found).

Tekla.Structures.Drawing.DatabaseObject.GetIntegerUserProperties(System.Collections.Generic.Dictionary{System.String,System.Int32}@)
Retrieves all integer user properties for the object with the given list of names.
values: Dictionary of name/value pairs that contain the values of the found user properties with the given names.
Returns: True if the request succeeded (the returned values can still be empty if no UserProperties were found).